{"format": "keras", "nodes": [{"name": "A0T1G3C6", "id": "A0T1G3C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G6C4", "id": "A0T0G6C4", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G5C5", "id": "A0T0G5C5", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G4C6", "id": "A0T0G4C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G2C7", "id": "A0T1G2C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G7C3", "id": "A0T0G7C3", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G0C9", "id": "A0T1G0C9", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G3C7", "id": "A0T0G3C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G8C2", "id": "A0T0G8C2", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G10C0", "id": "A0T0G10C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T10G0C0", "id": "A0T10G0C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "tf.expand_dims_77", "id": "tf.expand_dims_77", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_78", "id": "tf.expand_dims_78", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_79", "id": "tf.expand_dims_79", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_80", "id": "tf.expand_dims_80", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_81", "id": "tf.expand_dims_81", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_82", "id": "tf.expand_dims_82", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_83", "id": "tf.expand_dims_83", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_84", "id": "tf.expand_dims_84", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_85", "id": "tf.expand_dims_85", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_86", "id": "tf.expand_dims_86", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_87", "id": "tf.expand_dims_87", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "concatenate_7", "id": "concatenate_7", "class_name": "Concatenate", "output_shape": [null, 11], "num_parameters": 0}, {"name": "layer_normalization_2", "id": "layer_normalization_2", "class_name": "LayerNormalization", "output_shape": [null, 11], "num_parameters": 22}, {"name": "MLP", "id": "MLP", "class_name": "Sequential", "output_shape": [null, 11], "num_parameters": 561}, {"name": "sigmoid", "id": "sigmoid", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 12}], "edges": [["A0T1G3C6", "tf.expand_dims_77"], ["A0T0G6C4", "tf.expand_dims_78"], ["A0T0G5C5", "tf.expand_dims_79"], ["A0T0G4C6", "tf.expand_dims_80"], ["A0T1G2C7", "tf.expand_dims_81"], ["A0T0G7C3", "tf.expand_dims_82"], ["A0T1G0C9", "tf.expand_dims_83"], ["A0T0G3C7", "tf.expand_dims_84"], ["A0T0G8C2", "tf.expand_dims_85"], ["A0T0G10C0", "tf.expand_dims_86"], ["A0T10G0C0", "tf.expand_dims_87"], ["tf.expand_dims_77", "concatenate_7"], ["tf.expand_dims_78", "concatenate_7"], ["tf.expand_dims_79", "concatenate_7"], ["tf.expand_dims_80", "concatenate_7"], ["tf.expand_dims_81", "concatenate_7"], ["tf.expand_dims_82", "concatenate_7"], ["tf.expand_dims_83", "concatenate_7"], ["tf.expand_dims_84", "concatenate_7"], ["tf.expand_dims_85", "concatenate_7"], ["tf.expand_dims_86", "concatenate_7"], ["tf.expand_dims_87", "concatenate_7"], ["concatenate_7", "layer_normalization_2"], ["layer_normalization_2", "MLP"], ["MLP", "sigmoid"]]}