{"format": "keras", "nodes": [{"name": "A0T1G3C6", "id": "A0T1G3C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G6C4", "id": "A0T0G6C4", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G5C5", "id": "A0T0G5C5", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G4C6", "id": "A0T0G4C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G2C7", "id": "A0T1G2C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G7C3", "id": "A0T0G7C3", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G0C9", "id": "A0T1G0C9", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G3C7", "id": "A0T0G3C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G8C2", "id": "A0T0G8C2", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G10C0", "id": "A0T0G10C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T10G0C0", "id": "A0T10G0C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "tf.expand_dims_55", "id": "tf.expand_dims_55", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_56", "id": "tf.expand_dims_56", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_57", "id": "tf.expand_dims_57", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_58", "id": "tf.expand_dims_58", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_59", "id": "tf.expand_dims_59", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_60", "id": "tf.expand_dims_60", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_61", "id": "tf.expand_dims_61", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_62", "id": "tf.expand_dims_62", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_63", "id": "tf.expand_dims_63", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_64", "id": "tf.expand_dims_64", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_65", "id": "tf.expand_dims_65", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "concatenate_4", "id": "concatenate_4", "class_name": "Concatenate", "output_shape": [null, 11], "num_parameters": 0}, {"name": "layer_normalization", "id": "layer_normalization", "class_name": "LayerNormalization", "output_shape": [null, 11], "num_parameters": 22}, {"name": "concatenate_5", "id": "concatenate_5", "class_name": "Concatenate", "output_shape": [null, 11], "num_parameters": 0}, {"name": "MLP", "id": "MLP", "class_name": "Sequential", "output_shape": [null, 11], "num_parameters": 561}, {"name": "sigmoid", "id": "sigmoid", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 12}], "edges": [["A0T1G3C6", "tf.expand_dims_55"], ["A0T0G6C4", "tf.expand_dims_56"], ["A0T0G5C5", "tf.expand_dims_57"], ["A0T0G4C6", "tf.expand_dims_58"], ["A0T1G2C7", "tf.expand_dims_59"], ["A0T0G7C3", "tf.expand_dims_60"], ["A0T1G0C9", "tf.expand_dims_61"], ["A0T0G3C7", "tf.expand_dims_62"], ["A0T0G8C2", "tf.expand_dims_63"], ["A0T0G10C0", "tf.expand_dims_64"], ["A0T10G0C0", "tf.expand_dims_65"], ["tf.expand_dims_55", "concatenate_4"], ["tf.expand_dims_56", "concatenate_4"], ["tf.expand_dims_57", "concatenate_4"], ["tf.expand_dims_58", "concatenate_4"], ["tf.expand_dims_59", "concatenate_4"], ["tf.expand_dims_60", "concatenate_4"], ["tf.expand_dims_61", "concatenate_4"], ["tf.expand_dims_62", "concatenate_4"], ["tf.expand_dims_63", "concatenate_4"], ["tf.expand_dims_64", "concatenate_4"], ["tf.expand_dims_65", "concatenate_4"], ["concatenate_4", "layer_normalization"], ["layer_normalization", "concatenate_5"], ["concatenate_5", "MLP"], ["MLP", "sigmoid"]]}