{"format": "keras", "nodes": [{"name": "A0T1G3C6", "id": "A0T1G3C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G6C4", "id": "A0T0G6C4", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G5C5", "id": "A0T0G5C5", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G4C6", "id": "A0T0G4C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G2C7", "id": "A0T1G2C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G7C3", "id": "A0T0G7C3", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G0C9", "id": "A0T1G0C9", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G3C7", "id": "A0T0G3C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G8C2", "id": "A0T0G8C2", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G10C0", "id": "A0T0G10C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T10G0C0", "id": "A0T10G0C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "tf.expand_dims_66", "id": "tf.expand_dims_66", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_67", "id": "tf.expand_dims_67", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_68", "id": "tf.expand_dims_68", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_69", "id": "tf.expand_dims_69", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_70", "id": "tf.expand_dims_70", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_71", "id": "tf.expand_dims_71", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_72", "id": "tf.expand_dims_72", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_73", "id": "tf.expand_dims_73", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_74", "id": "tf.expand_dims_74", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_75", "id": "tf.expand_dims_75", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_76", "id": "tf.expand_dims_76", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "concatenate_6", "id": "concatenate_6", "class_name": "Concatenate", "output_shape": [null, 11], "num_parameters": 0}, {"name": "layer_normalization_1", "id": "layer_normalization_1", "class_name": "LayerNormalization", "output_shape": [null, 11], "num_parameters": 22}, {"name": "MLP", "id": "MLP", "class_name": "Sequential", "output_shape": [null, 11], "num_parameters": 561}, {"name": "sigmoid", "id": "sigmoid", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 12}], "edges": [["A0T1G3C6", "tf.expand_dims_66"], ["A0T0G6C4", "tf.expand_dims_67"], ["A0T0G5C5", "tf.expand_dims_68"], ["A0T0G4C6", "tf.expand_dims_69"], ["A0T1G2C7", "tf.expand_dims_70"], ["A0T0G7C3", "tf.expand_dims_71"], ["A0T1G0C9", "tf.expand_dims_72"], ["A0T0G3C7", "tf.expand_dims_73"], ["A0T0G8C2", "tf.expand_dims_74"], ["A0T0G10C0", "tf.expand_dims_75"], ["A0T10G0C0", "tf.expand_dims_76"], ["tf.expand_dims_66", "concatenate_6"], ["tf.expand_dims_67", "concatenate_6"], ["tf.expand_dims_68", "concatenate_6"], ["tf.expand_dims_69", "concatenate_6"], ["tf.expand_dims_70", "concatenate_6"], ["tf.expand_dims_71", "concatenate_6"], ["tf.expand_dims_72", "concatenate_6"], ["tf.expand_dims_73", "concatenate_6"], ["tf.expand_dims_74", "concatenate_6"], ["tf.expand_dims_75", "concatenate_6"], ["tf.expand_dims_76", "concatenate_6"], ["concatenate_6", "layer_normalization_1"], ["layer_normalization_1", "MLP"], ["MLP", "sigmoid"]]}