{"format": "keras", "nodes": [{"name": "A0T0G10C0", "id": "A0T0G10C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T10G0C0", "id": "A0T10G0C0", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "string_lookup_1", "id": "string_lookup_1", "class_name": "StringLookup", "output_shape": [null], "num_parameters": 0}, {"name": "string_lookup_2", "id": "string_lookup_2", "class_name": "StringLookup", "output_shape": [null], "num_parameters": 0}, {"name": "embedding", "id": "embedding", "class_name": "Embedding", "output_shape": [null, 16], "num_parameters": 224}, {"name": "embedding_1", "id": "embedding_1", "class_name": "Embedding", "output_shape": [null, 16], "num_parameters": 288}, {"name": "tf.stack", "id": "tf.stack", "class_name": "TFOpLambda", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "multihead_attention_0", "id": "multihead_attention_0", "class_name": "MultiHeadAttention", "output_shape": [null, 2, 16], "num_parameters": 4304}, {"name": "skip_connection1_0", "id": "skip_connection1_0", "class_name": "Add", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "layer_norm1_0", "id": "layer_norm1_0", "class_name": "LayerNormalization", "output_shape": [null, 2, 16], "num_parameters": 32}, {"name": "feedforward_0", "id": "feedforward_0", "class_name": "Sequential", "output_shape": [null, 2, 16], "num_parameters": 304}, {"name": "skip_connection2_0", "id": "skip_connection2_0", "class_name": "Add", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "layer_norm2_0", "id": "layer_norm2_0", "class_name": "LayerNormalization", "output_shape": [null, 2, 16], "num_parameters": 32}, {"name": "multihead_attention_1", "id": "multihead_attention_1", "class_name": "MultiHeadAttention", "output_shape": [null, 2, 16], "num_parameters": 4304}, {"name": "skip_connection1_1", "id": "skip_connection1_1", "class_name": "Add", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "layer_norm1_1", "id": "layer_norm1_1", "class_name": "LayerNormalization", "output_shape": [null, 2, 16], "num_parameters": 32}, {"name": "feedforward_1", "id": "feedforward_1", "class_name": "Sequential", "output_shape": [null, 2, 16], "num_parameters": 304}, {"name": "skip_connection2_1", "id": "skip_connection2_1", "class_name": "Add", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "layer_norm2_1", "id": "layer_norm2_1", "class_name": "LayerNormalization", "output_shape": [null, 2, 16], "num_parameters": 32}, {"name": "multihead_attention_2", "id": "multihead_attention_2", "class_name": "MultiHeadAttention", "output_shape": [null, 2, 16], "num_parameters": 4304}, {"name": "skip_connection1_2", "id": "skip_connection1_2", "class_name": "Add", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "layer_norm1_2", "id": "layer_norm1_2", "class_name": "LayerNormalization", "output_shape": [null, 2, 16], "num_parameters": 32}, {"name": "feedforward_2", "id": "feedforward_2", "class_name": "Sequential", "output_shape": [null, 2, 16], "num_parameters": 304}, {"name": "A0T1G3C6", "id": "A0T1G3C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G6C4", "id": "A0T0G6C4", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G5C5", "id": "A0T0G5C5", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G4C6", "id": "A0T0G4C6", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G2C7", "id": "A0T1G2C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G7C3", "id": "A0T0G7C3", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T1G0C9", "id": "A0T1G0C9", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G3C7", "id": "A0T0G3C7", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "A0T0G8C2", "id": "A0T0G8C2", "class_name": "InputLayer", "output_shape": [[null]], "num_parameters": 0}, {"name": "skip_connection2_2", "id": "skip_connection2_2", "class_name": "Add", "output_shape": [null, 2, 16], "num_parameters": 0}, {"name": "tf.expand_dims", "id": "tf.expand_dims", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_1", "id": "tf.expand_dims_1", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_2", "id": "tf.expand_dims_2", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_3", "id": "tf.expand_dims_3", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_4", "id": "tf.expand_dims_4", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_5", "id": "tf.expand_dims_5", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_6", "id": "tf.expand_dims_6", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_7", "id": "tf.expand_dims_7", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "tf.expand_dims_8", "id": "tf.expand_dims_8", "class_name": "TFOpLambda", "output_shape": [null, 1], "num_parameters": 0}, {"name": "layer_norm2_2", "id": "layer_norm2_2", "class_name": "LayerNormalization", "output_shape": [null, 2, 16], "num_parameters": 32}, {"name": "concatenate", "id": "concatenate", "class_name": "Concatenate", "output_shape": [null, 9], "num_parameters": 0}, {"name": "flatten", "id": "flatten", "class_name": "Flatten", "output_shape": [null, 32], "num_parameters": 0}, {"name": "layer_normalization_3", "id": "layer_normalization_3", "class_name": "LayerNormalization", "output_shape": [null, 9], "num_parameters": 18}, {"name": "concatenate_1", "id": "concatenate_1", "class_name": "Concatenate", "output_shape": [null, 41], "num_parameters": 0}, {"name": "MLP", "id": "MLP", "class_name": "Sequential", "output_shape": [null, 41], "num_parameters": 7011}, {"name": "sigmoid", "id": "sigmoid", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 42}], "edges": [["A0T0G10C0", "string_lookup_1"], ["A0T10G0C0", "string_lookup_2"], ["string_lookup_1", "embedding"], ["string_lookup_2", "embedding_1"], ["embedding", "tf.stack"], ["embedding_1", "tf.stack"], ["tf.stack", "multihead_attention_0"], ["multihead_attention_0", "skip_connection1_0"], ["tf.stack", "skip_connection1_0"], ["skip_connection1_0", "layer_norm1_0"], ["layer_norm1_0", "feedforward_0"], ["feedforward_0", "skip_connection2_0"], ["layer_norm1_0", "skip_connection2_0"], ["skip_connection2_0", "layer_norm2_0"], ["layer_norm2_0", "multihead_attention_1"], ["multihead_attention_1", "skip_connection1_1"], ["layer_norm2_0", "skip_connection1_1"], ["skip_connection1_1", "layer_norm1_1"], ["layer_norm1_1", "feedforward_1"], ["feedforward_1", "skip_connection2_1"], ["layer_norm1_1", "skip_connection2_1"], ["skip_connection2_1", "layer_norm2_1"], ["layer_norm2_1", "multihead_attention_2"], ["multihead_attention_2", "skip_connection1_2"], ["layer_norm2_1", "skip_connection1_2"], ["skip_connection1_2", "layer_norm1_2"], ["layer_norm1_2", "feedforward_2"], ["feedforward_2", "skip_connection2_2"], ["layer_norm1_2", "skip_connection2_2"], ["A0T1G3C6", "tf.expand_dims"], ["A0T0G6C4", "tf.expand_dims_1"], ["A0T0G5C5", "tf.expand_dims_2"], ["A0T0G4C6", "tf.expand_dims_3"], ["A0T1G2C7", "tf.expand_dims_4"], ["A0T0G7C3", "tf.expand_dims_5"], ["A0T1G0C9", "tf.expand_dims_6"], ["A0T0G3C7", "tf.expand_dims_7"], ["A0T0G8C2", "tf.expand_dims_8"], ["skip_connection2_2", "layer_norm2_2"], ["tf.expand_dims", "concatenate"], ["tf.expand_dims_1", "concatenate"], ["tf.expand_dims_2", "concatenate"], ["tf.expand_dims_3", "concatenate"], ["tf.expand_dims_4", "concatenate"], ["tf.expand_dims_5", "concatenate"], ["tf.expand_dims_6", "concatenate"], ["tf.expand_dims_7", "concatenate"], ["tf.expand_dims_8", "concatenate"], ["layer_norm2_2", "flatten"], ["concatenate", "layer_normalization_3"], ["flatten", "concatenate_1"], ["layer_normalization_3", "concatenate_1"], ["concatenate_1", "MLP"], ["MLP", "sigmoid"]]}